src/Catalogs/ПоказателиОповещений/ПоказателиОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОповещений</name>
  <owners>Catalog.Оповещения</owners>
  <attributes>
    <name>Функция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ЧислоНовыхОбъектов</types>
      <types>CatalogRef.ЧислоПаденийРабочихПроцессов</types>
      <types>CatalogRef.ЧислоСеансовПользователей</types>
      <types>CatalogRef.ИспользованиеОперативнойПамятиПроцессамиКластера</types>
      <types>CatalogRef.ПоказателиAPDEX</types>
      <types>CatalogRef.СкоростьРазбораПроблем</types>
      <types>CatalogRef.ТекущееЧислоВызововСервера</types>
      <types>CatalogRef.ЧислоИсключенийПоТехнологическомуЖурналу</types>
      <types>CatalogRef.ОценкаПользователей</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеБазы</types>
      <types>CatalogRef.СформированоОтчетов</types>
      <types>CatalogRef.ПоказателиСкоростиВыполненияТипичныхОпераций</types>
      <types>CatalogRef.ЧислоНерешенныхПроблем</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеРесурсы</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаРасчета</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СравниватьСПрошлым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеБазы</name>
    <type>
      <types>EnumRef.ВариантыСмещенияБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаБазы</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения</name>
    <type>
      <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ФункцииОповещений/ФункцииОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФункцииОповещений</name>
  <enumValues>
    <name>Минимум</name>
  </enumValues>
  <enumValues>
    <name>Максимум</name>
  </enumValues>
  <enumValues>
    <name>Среднее</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Количество</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ЕдиницыВремени/ЕдиницыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЕдиницыВремени</name>
  <enumValues>
    <name>Секунда</name>
  </enumValues>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыСравненияПоказателейОповещения/ВидыСравненияПоказателейОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСравненияПоказателейОповещения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>Изменился</name>
  </enumValues>
  <enumValues>
    <name>Между</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ПоказателиОповещений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередУдалением(Отказ)
	Если ЗначениеЗаполнено(Показатель) Тогда
		УдалениеОбъекта = Новый УдалениеОбъекта(Показатель);
		УдалениеОбъекта.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Булево(СравниватьСПрошлым) Тогда
		Индекс = ПроверяемыеРеквизиты.Количество() - 1;
		Пока Индекс >= 0 Цикл
			Если ПроверяемыеРеквизиты[Индекс] = "СмещениеБазы" 
				Или ПроверяемыеРеквизиты[Индекс] = "ИнтервалБазы" 
				Или ПроверяемыеРеквизиты[Индекс] = "ЕдиницаВремениИнтервалаБазы" 
				Или ПроверяемыеРеквизиты[Индекс] = "ПорогВПроцентах" 
				Тогда
				ПроверяемыеРеквизиты.Удалить(Индекс);
			КонецЕсли;
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СравниватьСПрошлым Тогда
		ПорогВПроцентах = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПоказателиМониторинга") Тогда
		ЗаполнитьПоПоказателюМониторинга(ДанныеЗаполнения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоПоказателюМониторинга(Знач ПоказательМониторинга)
	
	ЭтотОбъект.Функция = Перечисления.ФункцииОповещений.Максимум;
	ЭтотОбъект.ИнтервалРасчета = 60;
	ЭтотОбъект.ЕдиницаВремениИнтервалаРасчета = Перечисления.ЕдиницыВремени.Секунда;
	ЭтотОбъект.ВидСравнения = Перечисления.ВидыСравненияПоказателейОповещения.Больше;
	СкопироватьПоказатель(ПоказательМониторинга.Показатель);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СкопироватьПоказатель(ОбъектКопирования.Показатель);
	
КонецПроцедуры

Процедура СкопироватьПоказатель(Знач ИсходныйПоказатель)
	
	Если Не ЗначениеЗаполнено(ИсходныйПоказатель) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНового = Справочники.ПоказателиОповещений.ПолучитьСсылку();
	УстановитьСсылкуНового(СсылкаНового);
	
	ПоказательОбъект = ИсходныйПоказатель.ПолучитьОбъект().Скопировать();
	ПоказательОбъект.Владелец = СсылкаНового;
	ПоказательОбъект.ОбменДанными.Загрузка = Истина;
	ПоказательОбъект.Записать();
	
	ЭтотОбъект.Показатель = ПоказательОбъект.Ссылка;
	
КонецПроцедуры

#КонецЕсли
